update/sys_soap_message_function_c6db6fd0dbb26200cf69f20ebf96191c.xml

<?xml version="1.0" encoding="UTF-8"?>
<record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type/>
        <basic_auth_password/>
        <basic_auth_profile/>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://schemas.microsoft.com/sharepoint/soap/">
   <soapenv:Header/>
   <soapenv:Body>
      <soap:UpdateList>
         <!--Optional:-->
         <soap:listName>${UpdateList.listName}</soap:listName>
         <!--Optional:-->
         <soap:listProperties>
            e
            <!--You may enter ANY elements at this point-->
            gero
         </soap:listProperties>
         <!--Optional:-->
         <soap:newFields>
            cum
            <!--You may enter ANY elements at this point-->
            sonoras
         </soap:newFields>
         <!--Optional:-->
         <soap:updateFields>
            aeoliam
            <!--You may enter ANY elements at this point-->
            quae
         </soap:updateFields>
         <!--Optional:-->
         <soap:deleteFields>
            ventos
            <!--You may enter ANY elements at this point-->
            verrantque
         </soap:deleteFields>
         <!--Optional:-->
         <soap:listVersion>${UpdateList.listVersion}</soap:listVersion>
      </soap:UpdateList>
   </soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>ListsSoap.UpdateList</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <soap_action>http://schemas.microsoft.com/sharepoint/soap/UpdateList</soap_action>
        <soap_endpoint>https://share.autodesk.com/_vti_bin/lists.asmx</soap_endpoint>
        <soap_message display_value="SharePoint">8b3baf5cdb726200cf69f20ebf961999</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>Niloy</sys_created_by>
        <sys_created_on>2016-10-27 14:33:06</sys_created_on>
        <sys_customer_update>true</sys_customer_update>
        <sys_id>c6db6fd0dbb26200cf69f20ebf96191c</sys_id>
        <sys_mod_count>0</sys_mod_count>
        <sys_name>ListsSoap.UpdateList</sys_name>
        <sys_package display_value="Donatenow" source="x_66281_donatenow">28f36102db222200cf69f20ebf9619f5</sys_package>
        <sys_policy/>
        <sys_replace_on_upgrade>false</sys_replace_on_upgrade>
        <sys_scope display_value="Donatenow">28f36102db222200cf69f20ebf9619f5</sys_scope>
        <sys_update_name>sys_soap_message_function_c6db6fd0dbb26200cf69f20ebf96191c</sys_update_name>
        <sys_updated_by>Niloy</sys_updated_by>
        <sys_updated_on>2016-10-27 14:33:06</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server/>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
